# Naive Bayes Theorem

Naive Bayes Theorem is a supervised machine learning .. it is helped to solve the classification problem . it works on Bayes theorem

## Bayes Theorem
Bayes Theorem formula is :
- p(A/B)=p(B/A)*P(A)/ P(B)
* It is comes under the Conditional probablity

### Conditional Probablity :
- P(A/B) = p(Aâˆ©B)/P(B)

Some of the usecase of Naive Bayes are :
1. Spam Detection
2. Face Detection 
3. Weather Prediction 
4. Character Recoganization 
5. News Article Chatecarization

## for this we use Titanic Dataset :
Formula is P(SURVIVED/MALE&CLASS&AGE&CABIN&FARE)

In [17]:
import pandas as pd
df=pd.read_csv("titanic.csv")
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [18]:
df.drop(["PassengerId","Name","SibSp","Parch","Ticket","Cabin","Embarked"],axis=1,inplace=True)

In [19]:
df.head()

   Survived  Pclass     Sex   Age     Fare
0         0       3    male  22.0   7.2500
1         1       1  female  38.0  71.2833
2         1       3  female  26.0   7.9250
3         1       1  female  35.0  53.1000
4         0       3    male  35.0   8.0500

In [20]:
# make dependent and independent variable
y=df.Survived
x=df.drop(["Survived"],axis=1)

In [21]:
# convert sex into one_hot encoding
dummies=pd.get_dummies(x.Sex,drop_first=True)
dummies.head()

   male
0     1
1     0
2     0
3     0
4     1

In [22]:
x.head()

   Pclass     Sex   Age     Fare
0       3    male  22.0   7.2500
1       1  female  38.0  71.2833
2       3  female  26.0   7.9250
3       1  female  35.0  53.1000
4       3    male  35.0   8.0500

In [23]:
x=x.drop(["Sex"],axis=1)

In [24]:
x.head()

   Pclass   Age     Fare
0       3  22.0   7.2500
1       1  38.0  71.2833
2       3  26.0   7.9250
3       1  35.0  53.1000
4       3  35.0   8.0500

In [25]:
x=pd.concat([x,dummies],axis=1)

In [26]:
x.head()

   Pclass   Age     Fare  male
0       3  22.0   7.2500     1
1       1  38.0  71.2833     0
2       3  26.0   7.9250     0
3       1  35.0  53.1000     0
4       3  35.0   8.0500     1

In [27]:
x.isnull().sum()

Pclass      0
Age       177
Fare        0
male        0
dtype: int64

In [31]:
median=x.Age.median()
median

28.0

In [33]:
x.Age=x.Age.fillna(median)
x.head()

   Pclass   Age     Fare  male
0       3  22.0   7.2500     1
1       1  38.0  71.2833     0
2       3  26.0   7.9250     0
3       1  35.0  53.1000     0
4       3  35.0   8.0500     1

In [34]:
x.isnull().sum()

Pclass    0
Age       0
Fare      0
male      0
dtype: int64

In [36]:
df.shape

(891, 5)

In [54]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(x,y,test_size=0.2)

In [50]:
X_train.shape , X_test.shape

((712, 4), (179, 4))

In [51]:
# so when our dataset is Gaussian Distribution we use GaussianNB 
from sklearn.naive_bayes import GaussianNB
model=GaussianNB()

In [55]:
model.fit(X_train,y_train)

GaussianNB()

In [56]:
model.score(X_test,y_test)

0.776536312849162

In [62]:
y_test[:10]

713    0
697    1
598    0
422    0
819    0
471    0
322    1
609    1
835    1
363    0
Name: Survived, dtype: int64

In [63]:
pred=model.predict(X_test[:10])
pred

array([0, 1, 0, 0, 0, 0, 1, 1, 1, 0], dtype=int64)

In [65]:
model.predict_proba(X_test[:10])

array([[9.62452042e-01, 3.75479581e-02],
       [3.54474792e-01, 6.45525208e-01],
       [9.61656211e-01, 3.83437889e-02],
       [9.62159631e-01, 3.78403690e-02],
       [9.39609670e-01, 6.03903304e-02],
       [9.62972052e-01, 3.70279477e-02],
       [2.24299483e-01, 7.75700517e-01],
       [1.05725253e-04, 9.99894275e-01],
       [1.80089691e-02, 9.81991031e-01],
       [9.62939843e-01, 3.70601570e-02]])

## Now we use Spam Dataset

In [68]:
df=pd.read_csv("spam.csv")
df.head()

  Category                                            Message
0      ham  Go until jurong point, crazy.. Available only ...
1      ham                      Ok lar... Joking wif u oni...
2     spam  Free entry in 2 a wkly comp to win FA Cup fina...
3      ham  U dun say so early hor... U c already then say...
4      ham  Nah I don't think he goes to usf, he lives aro...

here ham means it is good mail and spam means not good mail

In [69]:
df.groupby("Category").describe()

         Message                                                            \
           count unique                                                top
Category
ham         4825   4516                             Sorry, I'll call later
spam         747    641  Please call our customer service representativ...


         freq
Category
ham        30
spam        4

In [70]:
df["spam"]=df.Category.apply(lambda x: 1 if x=="spam" else 0)
df.head()

  Category                                            Message  spam
0      ham  Go until jurong point, crazy.. Available only ...     0
1      ham                      Ok lar... Joking wif u oni...     0
2     spam  Free entry in 2 a wkly comp to win FA Cup fina...     1
3      ham  U dun say so early hor... U c already then say...     0
4      ham  Nah I don't think he goes to usf, he lives aro...     0

In [89]:
X_train, X_test, y_train, y_test = train_test_split(df.Message,df.spam,test_size=0.2)

In [72]:
X_train.shape , X_test.shape

((4457,), (1115,))

In [75]:
from sklearn.feature_extraction.text import CountVectorizer
v=CountVectorizer()
X_train_count=v.fit_transform(X_train.values)
X_train_count.toarray()[:3]

array([[0, 0, 0, ..., 0, 0, 0],
       [0, 0, 0, ..., 0, 0, 0],
       [0, 0, 0, ..., 0, 0, 0]], dtype=int64)

In [77]:
from sklearn.naive_bayes import MultinomialNB
model=MultinomialNB()
model.fit(X_train_count,y_train)

MultinomialNB()

In [81]:
## now we check the two message which is good or spam 
emails=[
    "hello buddy we have the match today ",
    "Upto 20% discount on parking, exclusive offer just for you. Dont miss this reward!"    
]
emails_count=v.transform(emails)
model.predict(emails_count)  #  0 means good and 1 means spam

array([0, 1], dtype=int64)

In [82]:
## check the accuracy 
x_test_count=v.transform(X_test)
model.score(x_test_count,y_test)

0.9874439461883409

## the another method web use pipelines

## PipeLine

In [92]:
from sklearn.pipeline import Pipeline
clf = Pipeline([
    ('vectorizer', CountVectorizer()),
    ('nb', MultinomialNB())
])

In [93]:
clf.fit(X_train, y_train)

Pipeline(steps=[('vectorizer', CountVectorizer()), ('nb', MultinomialNB())])

In [94]:
clf.score(X_test,y_test)

0.9847533632286996

In [95]:
clf.predict(emails)

array([0, 1], dtype=int64)